from Svetozar_05_dict import *
import unittest
# Порядок значений: 1 значение, 2 значение, результат операции
test_suite_add = [
    ['99', '1', '100'],
    ['0b1111', '0b10', '0b10001'],
    ['0o5576', '-0o777777', '-0o772201'],
    ['-0x1234ffa', '-0xfff', '-0x1235FF9'],
    ['0xfabb54', '0x88910', '0x1034464'],
    ['995184564523168', '6845354127841631', '7840538692364799'],
    ['57', '0', '57'],
    ['0b0', '0b110001', '0b110001'],
    ['-0x11ff5', '0x11ff5', '0x0'],
    ['0o1', '0o7', '0o10'],
    ['0', '0', '0'],
    ['8', '102', '110'],
    ['1', '99', '100']
]
test_suite_sub = [
    ['9', '5', '4'],
    ['-0o7', '-0o5', '-0o2'],
    ['-0xf', '-0x5', '-0xA'],
    ['0b0', '0b1', '-0b1'],
    ['100', '1', '99'],
    ['900000000000000000', '1', '899999999999999999'],
    ['50', '-50', '100'],
    ['0xff', '0xf0', '0xF'],
    ['-50', '50', '-100'],
    ['0b111', '0b111', '0b0'],
    ['0', '-999', '999'],
    ['999', '999', '0'],
    ['0', '0', '0']
]
test_suite_mul = [
    ['0', '0', '0'],
    ['0', '55', '0'],
    ['55', '0', '0'],
    ['-99', '5', '-495'],
    ['-5', '-99', '495'],
    ['999999999999999999', '555', '554999999999999999445'],
    ['555', '999999999999999999', '554999999999999999445'],
    ['0b111', '0b10', '0b1110'],
    ['0o7541', '0o561', '0o5425321'],
    ['0xfa12', '0x5d', '0x5AD88A'],
    ['100', '-100', '-10000'],
    ['100000001', '55', '5500000055'],
    ['55', '100000001', '5500000055']
]
test_suite_floordiv = [
    ['0', '10', '0'],
    ['5', '10', '0'],
    ['5', '-10', '-1'],
    ['-5', '10', '-1'],
    ['15', '-8', '-2'],
    ['555', '31', '17'],
    ['0xf', '0x5', '0x3'],
    ['0b1110', '0b11', '0b100'],
    ['0o7561', '0o11', '0o667'],
    ['9999999999999', '15', '666666666666'],
    ['15', '9999999999999', '0'],
    ['55', '1', '55'],
    ['55', '-1', '-55']
]
test_suite_mod = [
    ['0', '10', '0'],
    ['5', '10', '5'],
    ['5', '-10', '-5'],
    ['-5', '10', '5'],
    ['15', '-8', '-1'],
    ['555', '31', '28'],
    ['0xf', '0x5', '0x0'],
    ['0b1110', '0b11', '0b10'],
    ['0o7561', '0o11', '0o2'],
    ['9999999999999', '15', '9'],
    ['15', '9999999999999', '15'],
    ['55', '1', '0'],
    ['55', '-1', '0']
]


class TestCalk(unittest.TestCase):
    def test_add(self):
        for first, second, total in test_suite_add:
            self.assertEqual(str(Num(first) + Num(second)), total)

    def test_sub(self):
        for first, second, total in test_suite_sub:
            self.assertEqual(str(Num(first) - Num(second)), total)

    def test_mul(self):
        for first, second, total in test_suite_mul:
            self.assertEqual(str(Num(first) * Num(second)), total)

    def test_floordiv(self):
        for first, second, total in test_suite_floordiv:
            self.assertEqual(str(Num(first) // Num(second)), total)

    def test_mod(self):
        for first, second, total in test_suite_mod:
            self.assertEqual(str(Num(first) % Num(second)), total)


if __name__ == '__main__':
    unittest.main()